# Before you start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
# import numpy and pandas
import numpy as np
import pandas as pd

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the San Francisco. We will start by loading the dataset and examining its contents.

In [2]:
# Your code here:
salaries = pd.read_csv('../data/Salaries.csv')

/Users/ttrofff/opt/anaconda3/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

Examine the `salaries` dataset using the `head` function below.

In [3]:
# Your code here:
salaries.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

We see from looking at the `head` function that there is quite a bit of missing data. Get the amount of missing data in every column

In [5]:
# Your code here:
salaries.isna().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

Get the shape of the dataframe

In [6]:
# Your code here
salaries.shape

(148654, 13)

(148654, 13)

Given output of the previous two cells, drop the corresponding column and compute again the amount of missing values.

In [9]:
# Your code here 
salaries.drop('Notes', axis=1, inplace=True)
salaries.isna().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Agency                   0
Status              110535
dtype: int64

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Agency                   0
Status              110535
dtype: int64

Check out what are the possible values of the column "Status".

In [18]:
# Your code here
salaries['Status'].unique()

array([nan, 'PT', 'FT'], dtype=object)

array([nan, 'PT', 'FT'], dtype=object)

Drop any row with missing values in the "Status" column and compute again the number of missing values.

In [21]:
# Your code here
salaries = salaries[salaries['Status'].isna()==False]
salaries.shape

(38119, 12)

In [22]:
# Your code here
salaries.isna().sum()

Id                  0
EmployeeName        0
JobTitle            0
BasePay             0
OvertimePay         0
OtherPay            0
Benefits            0
TotalPay            0
TotalPayBenefits    0
Year                0
Agency              0
Status              0
dtype: int64

Id                  0
EmployeeName        0
JobTitle            0
BasePay             0
OvertimePay         0
OtherPay            0
Benefits            0
TotalPay            0
TotalPayBenefits    0
Year                0
Agency              0
Status              0
dtype: int64

Check out the types of each column and see if they make sense.

In [24]:
# Your code here
salaries.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 38119 entries, 110531 to 148653
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                38119 non-null  int64
 1   EmployeeName      38119 non-null  object
 2   JobTitle          38119 non-null  object
 3   BasePay           38119 non-null  object
 4   OvertimePay       38119 non-null  object
 5   OtherPay          38119 non-null  object
 6   Benefits          38119 non-null  object
 7   TotalPay          38119 non-null  float64
 8   TotalPayBenefits  38119 non-null  float64
 9   Year              38119 non-null  int64
 10  Agency            38119 non-null  object
 11  Status            38119 non-null  object
dtypes: float64(2), int64(2), object(8)
memory usage: 3.8+ MB

<class 'pandas.core.frame.DataFrame'>
Int64Index: 38119 entries, 110531 to 148653
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                38119 non-null  int64
 1   EmployeeName      38119 non-null  object
 2   JobTitle          38119 non-null  object
 3   BasePay           38119 non-null  object
 4   OvertimePay       38119 non-null  object
 5   OtherPay          38119 non-null  object
 6   Benefits          38119 non-null  object
 7   TotalPay          38119 non-null  float64
 8   TotalPayBenefits  38119 non-null  float64
 9   Year              38119 non-null  int64
 10  Agency            38119 non-null  object
 11  Status            38119 non-null  object
dtypes: float64(2), int64(2), object(8)
memory usage: 3.8+ MB

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status
110531,110532,David Shinn,Deputy Chief 3,129150.01,0.0,342802.63,38780.04,471952.64,510732.68,2014,San Francisco,PT
110532,110533,Amy P Hart,Asst Med Examiner,318835.49,10712.95,60563.54,89540.23,390111.98,479652.21,2014,San Francisco,FT
110533,110534,William J Coaker Jr.,Chief Investment Officer,257340.0,0.0,82313.7,96570.66,339653.70,436224.36,2014,San Francisco,PT
110534,110535,Gregory P Suhr,Chief of Police,307450.04,0.0,19266.72,91302.46,326716.76,418019.22,2014,San Francisco,FT
110535,110536,Joanne M Hayes-White,"Chief, Fire Department",302068.0,0.0,24165.44,91201.66,326233.44,417435.10,2014,San Francisco,FT

Do any type conversions and reset the index.

In [37]:
# Your code here
salaries['BasePay']=salaries['BasePay'].astype('float')
salaries['OvertimePay']=salaries['OvertimePay'].astype('float')
salaries['OtherPay']=salaries['OtherPay'].astype('float')
salaries['Benefits']=salaries['Benefits'].astype('float')
salaries=salaries.reset_index(drop=True)
salaries.head()

/var/folders/40/fpzt8rqs1hd_nf7fht4s6n240000gn/T/ipykernel_37189/3665151131.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries['BasePay']=salaries['BasePay'].astype('float')
/var/folders/40/fpzt8rqs1hd_nf7fht4s6n240000gn/T/ipykernel_37189/3665151131.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries['OvertimePay']=salaries['OvertimePay'].astype('float')
/var/folders/40/fpzt8rqs1hd_nf7fht4s6n240000gn/T/ipykernel_37189/3665151131.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries['OtherPay']=salaries['OtherPay'].astype('float')
/var/folders/40/fpzt8rqs1hd_nf7fht4s6n240000gn/T/ipykernel_37189/3665151131.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salaries['Benefits']=salaries['Benefits'].astype('float')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status
0,110532,David Shinn,Deputy Chief 3,129150.01,0.00,342802.63,38780.04,471952.64,510732.68,2014,San Francisco,PT
1,110533,Amy P Hart,Asst Med Examiner,318835.49,10712.95,60563.54,89540.23,390111.98,479652.21,2014,San Francisco,FT
2,110534,William J Coaker Jr.,Chief Investment Officer,257340.00,0.00,82313.70,96570.66,339653.70,436224.36,2014,San Francisco,PT
3,110535,Gregory P Suhr,Chief of Police,307450.04,0.00,19266.72,91302.46,326716.76,418019.22,2014,San Francisco,FT
4,110536,Joanne M Hayes-White,"Chief, Fire Department",302068.00,0.00,24165.44,91201.66,326233.44,417435.10,2014,San Francisco,FT

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status
0,110532,David Shinn,Deputy Chief 3,129150.01,0.00,342802.63,38780.04,471952.64,510732.68,2014,San Francisco,PT
1,110533,Amy P Hart,Asst Med Examiner,318835.49,10712.95,60563.54,89540.23,390111.98,479652.21,2014,San Francisco,FT
2,110534,William J Coaker Jr.,Chief Investment Officer,257340.00,0.00,82313.70,96570.66,339653.70,436224.36,2014,San Francisco,PT
3,110535,Gregory P Suhr,Chief of Police,307450.04,0.00,19266.72,91302.46,326716.76,418019.22,2014,San Francisco,FT
4,110536,Joanne M Hayes-White,"Chief, Fire Department",302068.00,0.00,24165.44,91201.66,326233.44,417435.10,2014,San Francisco,FT

Check out if "TotalPayBenefits" = "BasePay" + "OvertimePay" + "OtherPay" + "Benefits"

In [40]:
salaries['TotalPayBenefits']==salaries['BasePay']+salaries['OvertimePay']+salaries['OtherPay']+salaries['Benefits']
# Your code here

0         True
1        False
2         True
3        False
4         True
         ...
38114     True
38115     True
38116     True
38117     True
38118     True
Length: 38119, dtype: bool

0         True
1        False
2         True
3        False
4         True
         ...
38114     True
38115     True
38116     True
38117     True
38118     True
Length: 38119, dtype: bool

What is the percetage of employees for which the previous assumption is not True?

In [45]:
# Your code here:
(salaries['TotalPayBenefits']==salaries['BasePay']+salaries['OvertimePay']+salaries['OtherPay']+salaries['Benefits']).value_counts()/len(salaries)*100

True     73.708649
False    26.291351
dtype: float64

True     73.708649
False    26.291351
dtype: float64

There are different departments in the city. List all departments and the count of employees in each department.

In [61]:
# Your code here:

salaries.groupby(['JobTitle']).agg({'Id':pd.Series.nunique}).rename(columns = {'Id' : 'Employees'})

                                Employees
JobTitle
ACPO,JuvP, Juv Prob (SFERS)             1
ASR Senior Office Specialist           22
ASR-Office Assistant                   15
Account Clerk                          93
Accountant I                            2
...                                   ...
Wire Rope Cable Maint Sprv              1
Worker's Comp Supervisor 1              6
Worker's Compensation Adjuster         26
X-Ray Laboratory Aide                  35
Youth Comm Advisor                      1

[996 rows x 1 columns]

                                Employees
JobTitle
ACPO,JuvP, Juv Prob (SFERS)             1
ASR Senior Office Specialist           22
ASR-Office Assistant                   15
Account Clerk                          93
Accountant I                            2
...                                   ...
Wire Rope Cable Maint Sprv              1
Worker's Comp Supervisor 1              6
Worker's Compensation Adjuster         26
X-Ray Laboratory Aide                  35
Youth Comm Advisor                      1

[996 rows x 1 columns]

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of **all FT workers is significantly different from $75/hr**. Get first the hourly wage by dividing "TotalPayBenefits" by 50 weeks (assuming 10 labour days of holidays) and by 40hrs (assuming a 40hrs week).

$$Hourly Wage = \frac{TotalPayBenefits}{1 year}\frac{1 year}{50 Week}\frac{1 Week}{40 hr}$$

Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [62]:
# Your code here: (compute the "Hourly_Wage")
salaries['Hourly_Wage'] = salaries['TotalPayBenefits']/50/40
salaries.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status,Hourly_Wage
0,110532,David Shinn,Deputy Chief 3,129150.01,0.00,342802.63,38780.04,471952.64,510732.68,2014,San Francisco,PT,255.366340
1,110533,Amy P Hart,Asst Med Examiner,318835.49,10712.95,60563.54,89540.23,390111.98,479652.21,2014,San Francisco,FT,239.826105
2,110534,William J Coaker Jr.,Chief Investment Officer,257340.00,0.00,82313.70,96570.66,339653.70,436224.36,2014,San Francisco,PT,218.112180
3,110535,Gregory P Suhr,Chief of Police,307450.04,0.00,19266.72,91302.46,326716.76,418019.22,2014,San Francisco,FT,209.009610
4,110536,Joanne M Hayes-White,"Chief, Fire Department",302068.00,0.00,24165.44,91201.66,326233.44,417435.10,2014,San Francisco,FT,208.717550

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status,Hourly_Wage
0,110532,David Shinn,Deputy Chief 3,129150.01,0.00,342802.63,38780.04,471952.64,510732.68,2014,San Francisco,PT,255.366340
1,110533,Amy P Hart,Asst Med Examiner,318835.49,10712.95,60563.54,89540.23,390111.98,479652.21,2014,San Francisco,FT,239.826105
2,110534,William J Coaker Jr.,Chief Investment Officer,257340.00,0.00,82313.70,96570.66,339653.70,436224.36,2014,San Francisco,PT,218.112180
3,110535,Gregory P Suhr,Chief of Police,307450.04,0.00,19266.72,91302.46,326716.76,418019.22,2014,San Francisco,FT,209.009610
4,110536,Joanne M Hayes-White,"Chief, Fire Department",302068.00,0.00,24165.44,91201.66,326233.44,417435.10,2014,San Francisco,FT,208.717550

In [179]:
# Your code here: (compute the t_statistic). Take into account that this dataset is a sample of a real population.
# Remember that you only need to consider "FT" employees

salaries_ft=salaries[salaries['Status']=='FT']
hw = salaries_ft['Hourly_Wage']
mean = np.mean(hw)
n = len(salaries_ft)
stdev = np.std(hw, ddof=1)
t_stat = (mean-75)/(stdev/n**(1/2))
t_stat

-35.80631941460788

-35.80631941460788

In [180]:
# Method 1: Critical value. Get the critical value and compare it against your t_statisttic.
# Your code here: 
import scipy.stats
print(scipy.stats.t.ppf(0.05/2,df = len(hw)-1))
print(scipy.stats.t.ppf(1-0.05/2,df = len(hw)-1))
## t-statistic is far outside confidence interval => we are rejecting the null ()

-1.9600702128845597
1.9600702128845593

In [181]:
# Method 2: Use the p-value method.
# Your code here:
scipy.stats.t.cdf(t_stat,df = len(hw)-1)
## p-value for t_stat is very low (probability of our sample mean, when the pop mean is 75, is miserable)

2.2589156167195097e-273

In [182]:
# Method 3: Use the ttest_1samp function from scipy. 
# Check the documentation [here](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.ttest_1samp.html)
# Make sure that you have a scipy version >=1.6.0. If that's not your case please ugrade your scipy version using
# !pip install -U scipy
# Your code here:
from scipy.stats import ttest_1samp
t_stat_f, pval = scipy.stats.ttest_1samp(hw, popmean = 75, alternative = "two-sided")
print(t_stat_f)
print(pval)

-35.80631941460526
4.517831233839447e-273

Are all the methods in agreement?

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are **higher than last year's mean of $86000/year for all salaried employees** (use the column "TotalPayBenefits". Test  hypothesis using a 95% confidence interval.

Hint: Use apply and a lambda function to check in "Police" is in the "JobTitle" to get all the "Police" jobs.

50.252984742109916

In [183]:
# Your code here: (compute the t_statistic). Take into account that this dataset is a sample of a real population.
# Remember that you only need to consider "Police" employees
def carma_police(x):
    if 'Police' in x:
        return True
    else: return False
    
salaries['Police']=salaries['JobTitle'].apply(carma_police)
sp = salaries[salaries['Police']==True]['TotalPayBenefits']
mean = np.mean(sp)
std = np.std(sp, ddof=1)
t_stat=(mean-86000)/(std/np.sqrt(len(sp)))
t_stat

## H0: sample mean > 86k
## H1: sample mean < 86K

50.252984742109916

In [202]:
# Method 1: Critical value. Get the critical value and compare it against your statisttic.
# Your code here: 
scipy.stats.t.ppf(0.05,df = len(sp)-1)
## t_stat is higher than the critical value, the null is true
## we are deep into the acceptance region

-1.645656004264731

In [203]:
# Method 2: Use the p-value method.
# Your code here:
scipy.stats.t.cdf(t_stat,df = len(sp)-1)
## the probability of our sample mean of 148k if the population mean is less 86k is not discernable from 0
## (and vise versa the the prob of pop mean > 86k is 100%)
## we should accept the null

1.0

In [205]:
# Method 3: Use the ttest_1samp function from scipy. 
# Check the documentation [here](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.ttest_1samp.html)
# Make sure that you have a scipy version >=1.6.0. If that's not your case please ugrade your scipy version using
# !pip install -U scipy
# Your code here:
from scipy.stats import ttest_1samp
t_stat_f, pval = scipy.stats.ttest_1samp(sp, popmean = 86000, alternative = "less")
print(t_stat_f)
print(pval)

50.252984742109945
1.0

The workers from the "JobTitle" with the most employees have complained that their hourly wage is **less than $35/hour**. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [189]:
# Your code here: (Get the department which has most employees)
salaries.groupby(["JobTitle"]).agg({'Id':pd.Series.nunique}).sort_values(['Id'], ascending=False)

                                  Id
JobTitle
Transit Operator                2479
Special Nurse                   1478
Registered Nurse                1234
Public Svc Aide-Public Works     916
Firefighter                      815
...                              ...
Marina Associate Manager           1
Marina Assistant Manager           1
Light Rail Vehicle Equip Eng       1
Lieutenant (Police Department)     1
Youth Comm Advisor                 1

[996 rows x 1 columns]

In [198]:
# Your code here: (compute the t_statistic). Take into account that this dataset is a sample of a real population.
# Remember that you only need to consider the right "JobTitle" employees
salaries_to = salaries[salaries['JobTitle']=='Transit Operator']
to = salaries_to['Hourly_Wage']
mean = np.mean(to)
print('sample mean:',mean)
std = np.std(to, ddof = 1)
t_stat = (mean-35)/(std/np.sqrt(len(to)))
t_stat

## H0: sample mean < 35
## H1: sample mean > 35

sample mean: 43.35949773900775

19.064990324906553

In [199]:
# Method 1: Critical value. Get the critical value and compare it against your statisttic.
# Your code here: 
scipy.stats.t.ppf(1-0.05,len(to))

## we are deep into right rejection area, we are rejecting the null

1.6454685290091795

In [201]:
# Method 2: Use the p-value method.
# Your code here:
1-scipy.stats.t.cdf(t_stat,len(to))
## we are accepting the alternative hypothesis

0.0

In [135]:
# Method 3: Use the ttest_1samp function from scipy. 
# Check the documentation [here](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.ttest_1samp.html)
# Make sure that you have a scipy version >=1.6.0. If that's not your case please ugrade your scipy version using
# !pip install -U scipy
# Your code here:

t_test_f, pval = scipy.stats.ttest_1samp(to,35,alternative = "greater")
print(t_test_f)
print(pval)

19.064990324906383
5.012771694204206e-76

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level.

In [34]:
# Method 1: Get the critical values which correspond to a 95% confidence.
# Your code here:

Sample mean: 50.13
Confidence interval: [49.80,50.46]

In [151]:
hw = salaries['Hourly_Wage']
mean = np.mean(hw)
print('mean:',round(mean,2))
std = np.std(hw, ddof=1)
print('std:',round(std,2))
lower_border_t = scipy.stats.t.ppf(0.025,len(salaries)-1)
upper_border_t = scipy.stats.t.ppf(1-0.025,len(salaries)-1)
print('lower t:',lower_border_t)
print('upper t:',upper_border_t)
#(n-44)/(std/np.sqrt(len(hw)))
print('conf int low:',mean+lower_border_t*(std/np.sqrt(len(hw))))
print('conf int upp:',mean+upper_border_t*(std/np.sqrt(len(hw))))

mean: 50.13
std: 33.12
lower t: -1.9600262214170783
upper t: 1.9600262214170778
conf int low: 49.798255413084014
conf int upp: 50.46318325529486

Now compute a 95% confidence interval for the hourly salary of all the Police employees.

In [35]:
# Your code here:

Sample mean: 74.17
Confidence interval: [73.90,74.45]

In [157]:
sp = salaries[salaries['Police']==True]['Hourly_Wage']
mean = np.mean(sp)

print('mean:',round(mean,2))
std = np.std(sp, ddof=1)
print('std:',round(std,2))
lower_border_t = scipy.stats.t.ppf(0.025,len(sp)-1)
upper_border_t = scipy.stats.t.ppf(1-0.025,len(sp)-1)
print('lower t:',lower_border_t)
print('upper t:',upper_border_t)
#(n-44)/(std/np.sqrt(len(hw)))
print('conf int low:',mean+lower_border_t*(std/np.sqrt(len(sp))))
print('conf int upp:',mean+upper_border_t*(std/np.sqrt(len(sp))))

# due to some reasons, the my results dont match the expected slightly...

mean: 74.17
std: 27.05
lower t: -1.961213330573796
upper t: 1.9612133305737955
conf int low: 72.9578791736444
conf int upp: 75.3911629515526

# Challenge 4: Chi2 test

Now we want to know if the amount of full time "FT" and part time "PT" employees is equal between Lawers, Meds, Police, Firemen and other departments. 

Considering all the options in this groups of employees will be very time consuming. To simplify this process, create first a function that returns:

* "Policement" if "Police" is found on "JobTitle"
* "Firemen" if "Fire" is found on "JobTitle"
* "Medical" if "Med" or "Nurse" is found on "JobTitle"
* "Lawyer" if "Attorney" is found on "JobTitle"
* "Other" in any other cases

Then, create a new column named "employee_group" that determines to which group belong the employee.

In [220]:
# Your code here: (Create the function)
dic = {"Police":"Policement","Fire":"Firemen","Med":"Medical","Nurse":"Medical","Attorney":"Lawyer"}

def job_clean(x):
    y = "Other"
    for i in dic.keys():
        if i in x:
            y = dic[i]
    return y


salaries['employee_group'] = salaries['JobTitle'].apply(job_clean)
salaries['employee_group'].value_counts()
salaries.head(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status,Hourly_Wage,Police,employee_group
0,110532,David Shinn,Deputy Chief 3,129150.01,0.00,342802.63,38780.04,471952.64,510732.68,2014,San Francisco,PT,255.366340,False,Other
1,110533,Amy P Hart,Asst Med Examiner,318835.49,10712.95,60563.54,89540.23,390111.98,479652.21,2014,San Francisco,FT,239.826105,False,Medical
2,110534,William J Coaker Jr.,Chief Investment Officer,257340.00,0.00,82313.70,96570.66,339653.70,436224.36,2014,San Francisco,PT,218.112180,False,Other
3,110535,Gregory P Suhr,Chief of Police,307450.04,0.00,19266.72,91302.46,326716.76,418019.22,2014,San Francisco,FT,209.009610,True,Policement
4,110536,Joanne M Hayes-White,"Chief, Fire Department",302068.00,0.00,24165.44,91201.66,326233.44,417435.10,2014,San Francisco,FT,208.717550,False,Firemen

In [38]:
# Your code here: (Use the previous function to create a new column in the dataframe to store the "employee_group"

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Status,Hourly_Wage,employee_group
0,110532,David Shinn,Deputy Chief 3,129150.01,0.00,342802.63,38780.04,471952.64,510732.68,2014,San Francisco,PT,255.366340,Other
1,110533,Amy P Hart,Asst Med Examiner,318835.49,10712.95,60563.54,89540.23,390111.98,479652.21,2014,San Francisco,FT,239.826105,Medical
2,110534,William J Coaker Jr.,Chief Investment Officer,257340.00,0.00,82313.70,96570.66,339653.70,436224.36,2014,San Francisco,PT,218.112180,Other
3,110535,Gregory P Suhr,Chief of Police,307450.04,0.00,19266.72,91302.46,326716.76,418019.22,2014,San Francisco,FT,209.009610,Policemen
4,110536,Joanne M Hayes-White,"Chief, Fire Department",302068.00,0.00,24165.44,91201.66,326233.44,417435.10,2014,San Francisco,FT,208.717550,Firemen

Determine how many "PT" and "FT" employess have all the employees groups.

In [260]:
# Your code here: (Store the output dataframe into a new variable)
data_crosstab = pd.crosstab(salaries['employee_group'], salaries['Status'], margins = False)
data_crosstab

Status             FT     PT
employee_group
Firemen          1333    178
Lawyer            317    102
Medical          1028   2889
Other           18126  12245
Policement       1530    371

Status             FT     PT
employee_group
Firemen          1333    178
Lawyers           317    102
Medical          1028   2889
Other           18126  12245
Policemen        1530    371

Now try compute the expected frequencies doing the calculations with the individual probabilities. Remember that the Chi2 test assumes that both variables (employee_group and FT/PT) are not related (therefore they are independent). Therefore, to compute the expected frequencies you need to compute the probability of each cell and multiply it by the number of observations. ie:

$$\nu(x,y) = p(x,y) * N = p(x) * p(y) * N$$

bear in mind that in general: $p(x,y)\neq p(x)*p(y)$; the equality will only be true if x and y are independent. However, the null hypotheses says that **x and y are independent.** but that's what we're assuming with the null hypotheses.

where "x" is the "employee_group" and "y" the (FT/PT).

In [249]:
# Create an empty dataframe named "frequencies" to store the data.
# Your code here:
frequencies=pd.DataFrame(columns = ['FT','PT'],index=['Fireman','Lawyers','Medical','Other','Policeman'])
frequencies

            FT   PT
Fireman    NaN  NaN
Lawyers    NaN  NaN
Medical    NaN  NaN
Other      NaN  NaN
Policeman  NaN  NaN

In [292]:
# Your code here: Compute Expected frequency of being "Firemen" and "FT". Store the solution in a variable named "firemen_ft"


data_crosstab_upd=data_crosstab.reset_index(drop=False)
data_crosstab_upd=data_crosstab_upd
data_crosstab_upd.loc['Column_Total']= data_crosstab.sum(numeric_only=True, axis=0)
data_crosstab_upd.loc[:,'Row_Total'] = data_crosstab_upd[['FT','PT']].sum(numeric_only=True, axis=1)
display(data_crosstab_upd)


p_fireman = 1511/38119
p_ft = 22334/38119
firemen_ft = 1511/38119*22334/38119*38119
firemen_ft

Status       employee_group       FT       PT  Row_Total
0                   Firemen   1333.0    178.0     1511.0
1                    Lawyer    317.0    102.0      419.0
2                   Medical   1028.0   2889.0     3917.0
3                     Other  18126.0  12245.0    30371.0
4                Policement   1530.0    371.0     1901.0
Column_Total            NaN  22334.0  15785.0    38119.0

885.2979878800596

885.2979878800596

In [290]:
# Your code here: Compute Expected frequency of being "Firemen" and "PT". Store the solution in a variable named "firemen_pt"

p_pt = 15785/38119
firemen_pt = p_fireman * p_pt * 38119
firemen_pt

625.7020121199403

625.7020121199403

In [281]:
# Your code here: Compute Expected frequency of being "Lawyers" and "FT". Store the solution in a variable named "lawyers_ft"

p_lawyers = 419/38119
lawyers_ft = p_lawyers * p_ft * 38119
lawyers_ft

245.49295626852748

245.49295626852748

In [282]:
# Your code here: Compute Expected frequency of being "Lawyers" and "PT". Store the solution in a variable named "lawyers_pt"

lawyers_pt = p_lawyers * p_pt * 38119
lawyers_pt

173.5070437314725

173.5070437314725

In [283]:
# Your code here: Compute Expected frequency of being "Medical" and "FT". Store the solution in a variable named "medical_ft"

p_medical = 3917/38119
medical_ft = p_medical * p_ft * 38119
medical_ft

2294.9783047823917

2294.9783047823917

In [284]:
# Your code here: Compute Expected frequency of being "Medical" and "PT". Store the solution in a variable named "medical_pt"

medical_pt = p_medical * p_pt * 38119
medical_pt

1622.021695217608

1622.021695217608

In [285]:
# Your code here: Compute Expected frequency of being "Other" and "FT". Store the solution in a variable named "other_ft"

p_other = 30371/38119
other_ft = p_other * p_ft * 38119
other_ft

17794.430966184842

17794.430966184842

In [286]:
# Your code here: Compute Expected frequency of being "Other" and "PT". Store the solution in a variable named "other_pt"

other_pt = p_other * p_pt * 38119
other_pt

12576.569033815158

12576.569033815158

In [287]:
# Your code here: Compute Expected frequency of being "Policement" and "FT". Store the solution in a variable named "policemen_ft"


p_policeman = 1901.0/38119
policeman_ft = p_policeman * p_ft * 38119
policeman_ft

1113.7997848841785

1113.7997848841785

In [288]:
# Your code here: Compute Expected frequency of being "Policement" and "PT". Store the solution in a variable named "policemen_pt"

policeman_pt = p_policeman * p_pt * 38119
policeman_pt

787.2002151158215

787.2002151158215

* Store all the expected frequencies of "FT" employees in a list 
* Store all the "PT" employees into another list
* Create a dictionary with "FT" and "PT" as keys and as the values use the previous lists
* Create a dataframe with this dictionary using pd.DataFrame()

In [301]:
# Your code here:
list1=[firemen_ft,lawyers_ft,medical_ft,other_ft,policeman_ft]
list2=[firemen_pt,lawyers_pt,medical_pt,other_pt,policeman_pt]
dict1 = {'FT':list1,'PT':list2}
df_f = pd.DataFrame(dict1)
df_f

             FT            PT
0    885.297988    625.702012
1    245.492956    173.507044
2   2294.978305   1622.021695
3  17794.430966  12576.569034
4   1113.799785    787.200215

             FT            PT
0    885.297988    625.702012
1    245.492956    173.507044
2   2294.978305   1622.021695
3  17794.430966  12576.569034
4   1113.799785    787.200215

Now use the "st.chi2_contingency()" from scipy.stats [documentation here](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.chi2_contingency.html) to conduct a Chi2 test to determine if the diferences between employee groups are statistically significant using a 95% confidence level. Hint: fill the function with a dataframe of actual frequencies.

In [304]:
# Your code here: (use the st.chi2_contingency() function from scipy.stats to compute:
# The Chi2 value = 2676.642333711905
# The p-value = 0
# The expected frequencies.  
# Ho: there is no relationship
# Ha: there is relationship differences
# p_value = P(table | Ho) = P(table | no relationship) = 1.51e-6 < 0.05

import scipy.stats as st

st.chi2_contingency(data_crosstab)

(2676.642333711905,
 0.0,
 4,
 array([[  885.29798788,   625.70201212],
        [  245.49295627,   173.50704373],
        [ 2294.97830478,  1622.02169522],
        [17794.43096618, 12576.56903382],
        [ 1113.79978488,   787.20021512]]))

(2676.642333711905,
 0.0,
 4,
 array([[  885.29798788,   625.70201212],
        [  245.49295627,   173.50704373],
        [ 2294.97830478,  1622.02169522],
        [17794.43096618, 12576.56903382],
        [ 1113.79978488,   787.20021512]]))

In [306]:
# Use the p-value to determine if you accept or reject the null hypotheses.

## p_value < 0.05 -> reject Ho -> reject ( H0 there are no differences) -> there are differences

Check if your expected frequencies aggree with the ones obtained with the st.chi2_contingency() function